topics.org
#+AUTHOR: Gu Feng
#+TITLE: IELTS TOPICS
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/code-hide.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css" />
#+HTML: <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

* Technology
- 体力劳动几乎全部有男性完成 =manual labour has been performed almost exclusively by men= # 工序由电脑控制 =The process are all electronically controlled.=
- 因特网是传播信息的便捷途径 =The Internet is a convenient way to convey information.= #

- 一项科学突破 =a scientific breakthrough= 在...方面取得重大突破 =make a great breakthrough in= 依靠无线技术发达国家实现远程教育 =Based on wireless technology, developed countries have realised the breakthrough of providing long distance education for children in remote areas.=

- 持续暴力使谈判进程减速 =Continuing violence will retard the negotiations over the country's future.= 促进国际交流 =accelerate international exchange= 社会发展 =accelerate social development= 互联网加速信息传播 =The advent of the Internet has accelerated the flow of information.=
- 宇航员圆满完成任务 =The astronaut has accomplished the mission successfully.=
- 贪婪的社会 =acquisitive society= 所得 =acquisition= 获得学位 =acquire degree= 成年人需要学习电脑 =With the application of computers, many adults feel the pressing need of acquiring computer literacy.=

* Environment :MY1
- 穿着保守 =conservatively dressed= 人们年轻时开放年纪大后保守 =People tend to be more liberal when they are young and become more conservative as they get older.= 保护文化遗产 =conserve cultural treasures= 保护自然资源 =conserve natural resources= 为后代保护林地 =We must conserve our woodlands for future generations.=
- 耗时的 =time-consuming= 消耗能量 =consume energy= 过度消费导致严重赤字 =excessive consumption resulted in heavy trade deficit= 粗放灌溉消耗宝贵水资源 =Extensive irrigation consumes our scarce freshwater resources.=
- 有效防范能够控制人口增长减轻环境压力 =Effective precautions can help the control population growth and alleviate environmental pressures= #
- 耕地 =cultivatable land= 把耕地作为开发区的政策受到严厉批评被视为不环保 =The policies of turning tillable fields into development zones have been severely criticized and regarded as environmentally unfriendly/environment-unfriendly.= #

- 促进当地旅游业 =boost local tourism= 促进当地第三产业 =boost local tertiary industry= 政府应多办活动促进环保意识 =More public activities should be sponsored by the government to boost the public awareness of environmental protection.=
- 开车不顾交通法规 =drive with blithe disregard for rules of the road= 热爱故土 =cherish one's native land= 教育公民珍惜水不要浪费水资源 =Citizens shoud be educated to cherish every drop of water and never lavish our scarce freshwater resources.=

- 禁止电视广告 =ban on all television advertising= 禁养宠物 =ban on pets= 禁烟 =ban on smoking= 准许搜查 =give his consent to the search= 同意年龄 =age of consent= 总统支持全面禁止核试验 =The President supports a global ban on nuclear testing.=
- 灾难性后果 =catastrophic ramifications= 一次交通事故造成的不幸 =a mishap of traffic accident= # 可怕的战争 =frightful war= 再次欠收将是农民的灾难 =It's would be a calamity for the farmers if the crops failed again.=

- 性兴奋 =sexual arousal= 毫无睡意 =feel wide awake= 上班时间打瞌睡 =have fallen asleep on the job= 惹怒 =provoke someone= 刺激经济 =stimulate the economy= 搅动汤 =stir the soup= 激发好奇/热情/兴趣 =arouse curiosity/enthusiasm/interest= 酸雨激发环保意识 =Acid rain arouses people's awareness of environmental protection.=
- 沙漠化损失估计上百万 =Damage caused by desertification was assessed at millions of dollars.=
- 容忍儿子的行为 =put up with the behaviour of their son= 持久的友谊 =enduring friendship= 承担重任 =bear heavy burden= 请耐心听我说 =bear with me= 牢记珍惜水资源 =We should always bear in mind that freshwater resources are our lifeblood that we should cherish.=

- 占据统治地位 =achieve dominance over the region= 获得地位 =achieve status= 政府努力实现资源可持续发展 =Governments should endeavour to achieve sustainable development of resources.=

* Culture :MY2
- 相互协调 =harmonize with each other= 发展得当的话旅游业与保护古建筑不矛盾 =Carried out in the right way, tourism may not conflict with the conservation of historic buildings.=

- 收拾好行李 =collect one's belongings= 关于家庭关系的事情 =matters pertaining to family relationship= 文化遗产属于全人类 =Cultural heritage belongs to all human beings.=

- 撤销(婚姻) =annulment of marriage= 废止(法令) =repeal an act= 封建迷信尽早废除,毒害人心 =The abolishment of superstitious practices and customs should be carried out as soon as possible since they may poison people's mind.= #
- 社会富足 =the enrichment of society= 孩子似的兴高采烈 =childlike exuberance= # 愈加匮乏的水资源 =an ever increasing scarcity of water= 货源充足 =available in abundance= 丰年 =a year of abundance= 图书馆丰富的历史文化书籍能让市民了解国家的过去 =The abundance of historical and cultural books in libraries enables citizens to have an understanding of the countries' past.=
- 市民免费使用图书馆获得信息 =Citizens should have free access to the library so that they may get contact with the latest information.=
- 成就感 =a sense of accomplishment= 满足感 =a sense of fulfillment= # 奥运会开幕被用于宣传 =The opening ceremonies of the Olympic Games are now used to publicise the host countries' accomplishment and reveal the countries' connotation.= #
- 自由的氛围 =the atmosphere of freedom= 气压 =atmosphere pressure= # 经济形势 =economic atmosphere= 学习氛围 =learning atmosphere= 老房子有魅力 =This old building has a lot of atmosphere.=

- 公开表示完全赞同 =endorse the opinion wholeheartedly= 代言系列美容产品 =endorse a line of cosmetic products= 签订条约 =ratify a treaty= 反对... =object to= 赞同观点 =approve one's opinion= 批准项目 =approve the project= 市政府应立项资助传统艺术家以弘扬独特本土文化 =The municipal government should approve a scheme which aims to subsidize traditional artists so as to carry forward our unique indigenous culture.= #
- 调节争执/纠纷 =arrange quarrel/dispute= # 婚姻中的冲突 =strife in marriage= 政府应筹划项目以挽救濒危语言 =The government should arrange for special programmes to save endangered languages.=
- 猜测 =speculate about something= 想必... =presumably= 承担责任 =assume the responsibility= 语言学家有责任保护濒危语言 =Linguists assume new duties of storing as much information as possible about extinct languages.=

- 对宪法严格遵守 =adhere to constitution= 追随者 =adherent= 紧紧抓住 =cling to= 坚持原则/意见 =adhere to one's principle/opinion= 鼓励原住民坚持传统 =Aboriginals should be encouraged to adhere to their cultural traditions.=
- 自暴自弃 =abandon oneself to despair= # 不能放弃民族特性 =People should never abandon their national identity.=
- 吸取精华 =absorb the quintessence= 专心研读 =be absorbed in study= 保护文化遗产,去糟取精 =The best way to protect our cultural heritage is to absorb the essence and discard the dregs.=

