topics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>IELTS TOPICS</title>
<!-- 2014-10-14 Tue 10:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gu Feng" />
<link rel="stylesheet" type="text/css" href="css/code-hide.css" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">IELTS TOPICS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Technology</a></li>
<li><a href="#sec-2">2. Environment</a></li>
<li><a href="#sec-3">3. Culture</a></li>
<li><a href="#sec-4">4. Ethics</a></li>
<li><a href="#sec-5">5. Education</a></li>
<li><a href="#sec-6">6. Animal</a></li>
<li><a href="#sec-7">7. Rights</a></li>
<li><a href="#sec-8">8. Work &amp; Life</a></li>
<li><a href="#sec-9">9. Crime</a></li>
<li><a href="#sec-10">10. Health</a></li>
<li><a href="#sec-11">11. Bonus</a></li>
<li><a href="#sec-12">12. Sleeping on the Job: Should You Nap at Work?</a></li>
<li><a href="#sec-13">13. <span class="todo TODO">TODO</span> </a></li>
</ul>
</div>
</div>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Technology</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>体力劳动几乎全部有男性完成 <code>manual labour has been performed almost exclusively by men</code> # 工序由电脑控制 <code>The process are all electronically controlled.</code>
</li>
<li>因特网是传播信息的便捷途径 <code>The Internet is a convenient way to convey information.</code> #
</li>

<li>一项科学突破 <code>a scientific breakthrough</code> 在&#x2026;方面取得重大突破 <code>make a great breakthrough in</code> 依靠无线技术发达国家实现远程教育 <code>Based on wireless technology, developed countries have realised the breakthrough of providing long distance education for children in remote areas.</code>
</li>

<li>减速 <code>Continuing violence will retard the negotiations over the country's future.</code> 促进国际交流 <code>accelerate international exchange</code> 社会发展 <code>accelerate social development</code> 互联网加速信息传播 <code>The advent of the Internet has accelerated the flow of information.</code>
</li>
<li>宇航员圆满完成任务 <code>The astronaut has accomplished the mission successfully.</code>
</li>
<li>贪婪的社会 <code>acquisitive society</code> 所得 <code>acquisition</code> 获得学位 <code>acquire degree</code> 成年人需要学习电脑 <code>With the application of computers, many adults feel the pressing need of acquiring computer literacy.</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Environment</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>穿着保守 <code>conservatively dressed</code> 人们年轻时开放年纪大后保守 <code>People tend to be more liberal when they are young and become more conservative as they get older.</code> 保护文化遗产 <code>conserve cultural treasures</code> 保护自然资源 <code>conserve natural resources</code> 为后代保护林地 <code>We must conserve our woodlands for future generations.</code>
</li>
<li>耗时的 <code>time-consuming</code> 消耗能量 <code>consume energy</code> 过度消费导致严重赤字 <code>excessive consumption resulted in heavy trade deficit</code> 粗放灌溉消耗宝贵水资源 <code>Extensive irrigation consumes our scarce freshwater resources.</code>
</li>
<li>有效防范,控制人口增长,减轻环境压力 <code>with effective precautions, control population growth and alleviate environmental pressures</code> #
</li>
<li>耕地 <code>cultivatable land</code> 把耕地作为开发区的政策受到严厉批评被视为不环保 <code>The policies of turning tillable fields into development zones have been severely criticized and regarded as environmentally unfriendly/environment-unfriendly.</code> #
</li>

<li>促进当地旅游业 <code>boost local tourism</code> 促进当地第三产业 <code>boost local tertiary industry</code> 政府应多办活动促进环保意识 <code>More public activities should be sponsored by the government to boost the public awareness of environmental protection.</code>
</li>
<li>开车不顾交通法规 <code>drive with blithe disregard for rules of the road</code> 热爱故土 <code>cherish one's native land</code> 教育公民珍惜水不要浪费水资源 <code>Citizens shoud be educated to cherish every drop of water and never lavish our scarce freshwater resources.</code>
</li>

<li>禁止电视广告 <code>ban on all television advertising</code> 禁养宠物 <code>ban on pets</code> 禁烟 <code>ban on smoking</code> 准许搜查 <code>give his consent to the search</code> 同意年龄 <code>age of consent</code> 总统支持全面禁止核试验 <code>The President supports a global ban on nuclear testing.</code>
</li>
<li>灾难性后果 <code>catastrophic ramifications</code> 一次交通事故造成的不幸 <code>a mishap of traffic accident</code> # 可怕的战争 <code>frightful war</code> 再次欠收将是农民的灾难 <code>It's would be a calamity for the farmers if the crops failed again.</code>
</li>

<li>性兴奋 <code>sexual arousal</code> 毫无睡意 <code>feel wide awake</code> 上班时间打瞌睡 <code>have fallen asleep on the job</code> 惹怒 <code>provoke someone</code> 刺激经济 <code>stimulate the economy</code> 搅动汤 <code>stir the soup</code> 激发好奇/热情/兴趣 <code>arouse curiosity/enthusiasm/interest</code> 酸雨激发环保意识 <code>Acid rain arouses people's awareness of environmental protection.</code>
</li>
<li>沙漠化损失估计上百万 <code>Damage caused by desertification was assessed at millions of dollars.</code>
</li>
<li>容忍儿子的行为 <code>put up with the behaviour of their son</code> 持久的友谊 <code>enduring friendship</code> 承担重任 <code>bear heavy burden</code> 请耐心听我说 <code>bear with me</code> 牢记珍惜水资源 <code>We should always bear in mind that freshwater resources are our lifeblood that we should cherish.</code>
</li>

<li>占据统治地位 <code>achieve dominance over the region</code> 获得地位 <code>achieve status</code> 政府努力实现资源可持续发展 <code>Governments should endeavour to achieve sustainable development of resources.</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Culture</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>相互协调 <code>harmonize with each other</code> 发展得当的话旅游业与保护古建筑不矛盾 <code>Carried out in the right way, tourism may not conflict with the conservation of historic buildings.</code>
</li>

<li>收拾好行李 <code>collect one's belongings</code> 关于家庭关系的事情 <code>matters pertaining to family relationship</code> 文化遗产属于全人类 <code>Cultural heritage belongs to all human beings.</code>
</li>

<li>撤销(婚姻) <code>annulment of marriage</code> 废止(法令) <code>repeal an act</code> 封建迷信尽早废除,毒害人心 <code>The abolishment of superstitious practices and customs should be carried out as soon as possible since they may poison people's mind.</code> #
</li>
<li>社会富足 <code>the enrichment of society</code> 孩子似的兴高采烈 <code>childlike exuberance</code> # 愈加匮乏的水资源 <code>an ever increasing scarcity of water</code> 货源充足 <code>available in abundance</code> 丰年 <code>a year of abundance</code> 图书馆丰富的历史文化书籍能让市民了解国家的过去 <code>The abundance of historical and cultural books in libraries enables citizens to have an understanding of the countries' past.</code>
</li>
<li>市民免费使用图书馆获得信息 <code>Citizens should have free access to the library so that they may get contact with the latest information.</code>
</li>
<li>成就感 <code>a sense of accomplishment</code> 满足感 <code>a sense of fulfillment</code> # 奥运会开幕被用于宣传 <code>The opening ceremonies of the Olympic Games are now used to publicise the host countries' accomplishment and reveal the countries' connotation.</code> #
</li>
<li>自由的氛围 <code>the atmosphere of freedom</code> 气压 <code>atmosphere pressure</code> # 经济形势 <code>economic atmosphere</code> 学习氛围 <code>learning atmosphere</code> 老房子有魅力 <code>This old building has a lot of atmosphere.</code>
</li>

<li>公开表示完全赞同 <code>endorse the opinion wholeheartedly</code> 代言系列美容产品 <code>endorse a line of cosmetic products</code> 签订条约 <code>ratify a treaty</code> 反对&#x2026; <code>object to</code> 赞同观点 <code>approve one's opinion</code> 批准项目 <code>approve the project</code> 市政府应立项资助传统艺术家以弘扬独特本土文化 <code>The municipal government should approve a scheme which aims to subsidize traditional artists so as to carry forward our unique indigenous culture.</code> #
</li>
<li>调节争执/纠纷 <code>arrange quarrel/dispute</code> # 婚姻中的冲突 <code>strife in marriage</code> 政府应筹划项目以挽救濒危语言 <code>The government should arrange for special programmes to save endangered languages.</code>
</li>
<li>猜测 <code>speculate about something</code> 想必&#x2026; <code>presumably</code> 承担责任 <code>assume the responsibility</code> 语言学家有责任保护濒危语言 <code>Linguists assume new duties of storing as much information as possible about extinct languages.</code>
</li>

<li>对宪法严格遵守 <code>adhere to constitution</code> 追随者 <code>adherent</code> 紧紧抓住 <code>cling to</code> 坚持原则/意见 <code>adhere to one's principle/opinion</code> 鼓励原住民坚持传统 <code>Aboriginals should be encouraged to adhere to their cultural traditions.</code>
</li>
<li>自暴自弃 <code>abandon oneself to despair</code> # 不能放弃民族特性 <code>People should never abandon their national identity.</code>
</li>
<li>吸取精华 <code>absorb the quintessence</code> 专心研读 <code>be absorbed in study</code> 保护文化遗产,去糟取精 <code>The best way to protect our cultural heritage is to absorb the essence and discard the dregs.</code>
</li>
</ul>
</div>
</div>
