topics.org
* Ethics   :MY1
- 夫妻间感性和理性需求与维持婚姻本身相比是次要的 =The emotional and intellectual needs of spouses are secondary to the survival of the marriage itself.=

- 计划生育无可厚非 =China's family planning policy is above/beyond reproach.= 科学家谴责克隆人因为有悖伦理道德 =Many scientists condemn cloning human beings for it is morally and ethically wrong.=
- 正反意见抵消 =The pros and cons cancel out.=

- 令人震惊,无法容忍 =outrageous and intolerable=
- 受责任心,道德约束或至少法律的制约 =be subject to the sense of responsibility, moral obligation or at least the law= #
- 知识型社会的出现 =the advent of knowledge-based society= 互联网的出现 =the advent of the Internet= 随着第一只克隆羊的出现人类克隆违法自然的讨论加剧 =The discussion on whether the human race can go against nature by cloning themselves has heated with the advent of the first cloned sheep Dolly.=

- 销毁核武器 =do away with nuclear weapons= 废除体罚/旧俗 =abolish corporal punishment/outdated customs= 废除死刑的争论 =There arises a heated debate on whether capital punishment should be abolished.=

* Education
- 遵从环保规定 =comply with environmental regulations= 遵守社会规范 =conform to social norms= 从入学第一天起学生就要遵守校规 =On the first day a pupil enters school, he is asked to conform to the school rules.=
- 没有公司更够承担中国为敌的后果 =No company can afford to antagonize China.= 合作融洽 =cooperate in harmony= 寄宿学校学生学会合作和互让,为以后成功培养人际交往能力 =In a boarding school, students learn to cooperate and compromise, and develop interpersonal skills needed for future successes.= #
- 取长补短 =learn from other's strong points and overcome our weakness= 求同存异 =to seek common ground while reserving differences= 盲目/机械地照做 =copy things blindly/mechanically= # 扼杀天才 =kill one's talent= 其实正相反,压力扼杀创造力 =Quite the opposite/On the contrary, I think pressure stifles creativity.=
- 消除误解 =correct misapprehension= 改正过错 =correct one's fault= 改变印象 =correct impression=
- 养育孩子 =bring up children= 提出一个课题 =bring up a subject= 培养责任感 =cultivate a strong sense of responsibility= 出国留学开阔视野充实思想培养自立 =Overseas study broadens one's vision, enriches one's mind and cultivates independence.=
- 违抗母亲 =defy my mother= 我敢说你不知道答案 =I defy you to come up with an answer= 挑战权威 =challenge the authority= 学生认为老师说的不对提出质疑 =Once students think what a teacher says is not correct, they defy him.=
- 远程教育和传统教育互补 =Tele-education and traditional classroom teaching complement each other.=
- 学生应该专心学习,兼职可能会分散注意力 =A student should concentrate his/her attention on academic study and taking a part time job may divert his/her attention.=
- 他拒绝透露关于那个人的任何消息 =He refused to divulge any information related to/regarding/concerning/involving the man's whereabouts.= 大学生应该更关心公共事务 =College students should concern themselves more with public affairs.=

- 优缺点 =merits and demerits= 艺术成就 =artistic achievement= 科学成就 =scientific achievement= 穿校服提高成绩应该普及 =School uniforms increase attendance and academic achievements, so the practice of wearing uniforms at school should be popularised.= #

- 令人讨厌的是 =to one's annoyance= 担心别人的问题 =fret about everyone else's problems= 在我背后说闲话让人恼火 =It vexed me to think of others gossiping behind my back.= 父母烦恼与孩子游戏成瘾 =Parents are annoyed with children's addiction to computer games.=
- 无法避免 =unavoidable= 必然地 =inevitably= # 逃避税/问题/目光 =evade paying tax/issue/one's eyes= 特意回避 =we all shunned him= # 避免尴尬/误会 =avoid embarrassment/misleading= 年轻人学会花钱避免浪费 =Young people should learn to spend money carefully and avoid extravagance.= #
- 不可否认学校该禁烟 =It's undeniable that smoking should be banned in school.=
- 学术不端 =academic misconduct= 做实验 =conduct an experiment= 违法行为 =wrongdoing= 他表现勇敢 =He behaved with great courage.=
- 年轻人沉静其中而没有意识到他们有多努力 =The youngsters were so absorbed in it and did not realise how much they are exerting themselves.= 不要做无用功 =Do not exert yourself unnecessarily.=

- 信守诺言 =abide by one's commitment= 遵守规则 =abide by the rules= 教育儿童遵守法律 =Children should be taught to abide by the law.=

- 分配一大笔资金 =allocate a large sum of money= 任务(给)、资源 =allocate a task to someone/resources= 分配给公共教育的资金不该被滥用 =Funds allocated for public education should not be misused.=
- 为无家可归者提供食宿 =afford food and beds for the homeless= 无法支付巨额损失 =cannot afford to pay for the loss= 农村儿童没钱上学成文盲 =In rural areas, many children can't afford to go to school and become illiterates.=
- 情感 =affection= 受感染的 =infected= 影响学习成绩 =affect school achievement= 家庭关系 =family relationship= 心理健康发展 =healthy psychological development= 沉溺电脑游戏严重影响学习 =Indulgence in computer game will affect one's academic performance seriously.=
- 主张或反对(观点) =argue for or argue against= 倡导世界和平 =advocate world peace= 为了吸引人们从事教育,专家主张提高工资 =In order to attract more people to take up teaching as their lifelong pursuit, some experts advocate higher salaries for teachers.= #
- 公认地 =admittedly= 承认失败 =admit defeat= / 承认罪行 =admit one's crime= 考生没通过考试不会被录取 =If a candidate fails in the IELTS test, he/she will not be admitted into a university in Australia.= #

* Animal
- 熊猫和秃鹰被列为濒危物种 =Pandas and bald eagles are classified as endangered species.= #
- sue complain grumble whine mutter murmur 邻居家养宠物的人们总是埋怨睡觉被吵醒 =People whose neighbours have pets always complain that their sleep is interrupted at midnight by the pets' noises.=

- 年轻人适应新环境的能力 =the adaptability of youth to new surroundings= 社会适应力 =the adaptability to the society= 砍伐森林导致动物灭亡 =The deforestation will drive animals without the adaptability to new surroundings into mass extinction.=
- 请某人援助 =call in one's aid= 急救 =first aid= 经济援助 =financial aid= 国际援助 =international aid= 与宠物的积极关系有助于建立与他人的信任 =Positive relationships with pets can be an aid in the development of trusting relationships with others.=
- 禁毒运动 =a campaign against drug abuse= 竞选活动 =an election campaign= 参加游行 =join the parade= 发起运动 =launch a campaign= 中国越来越多人加入到保护珍稀动物的运动 =More and more people in China have entered the campaign to save rare animals from extinction.=

- 据说 =assertedly= 证实观点 =affirm the opinion= 宣读诗篇 =declaim verse to us= 宣布你们结为夫妻 =I now pronounce you husband and wife.= # 这个缺点抵消了本来还算开明的态度 =the weakness negate his otherwise progressive attitude= 维护权利 =assert one's rights= 动物保护人士反对为了人类利益虐待动物 =Animal activists assert their opposition to the fact that animals are abused for man's interests.=

- 滥用权力 =abuse one's rights= 虐待动物不道德 =It's unethical and barbaric to abuse animals.=

* Rights

