topics.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Ethics</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>夫妻间感性和合理性需求与维持婚姻本身相比是次要的 <code>The emotional and intellectual needs of spouses are secondary to the survival of the marriage itself.</code>
</li>

<li>计划生育无可厚非 <code>China's family planning policy is above/beyond reproach.</code> 科学家谴责克隆人因为有悖伦理道德 <code>Many scientists condemn cloning human beings for it is morally and ethically wrong.</code>
</li>
<li>正反意见抵消 <code>The pros and cons cancel out.</code>
</li>

<li>令人震惊,无法容忍 <code>outrageous and intolerable</code>
</li>
<li>受责任心,道德约束或至少法律的制约 <code>be subject to the sense of responsibility, moral obligation or at least the law</code> #
</li>
<li>知识型社会的出现 <code>the advent of knowledge-based society</code> 互联网的出现 <code>the advent of the Internet</code> 随着第一只克隆羊的出现人类克隆违法自然的讨论加剧 <code>The discussion on whether the human race can go against nature by cloning themselves has heated with the advent of the first cloned sheep Dolly.</code>
</li>

<li>销毁核武器 <code>do away with nuclear weapons</code> 废除体罚/旧俗 <code>abolish corporal punishment/outdated customs</code> 废除死刑的争论 <code>There arises a heated debate on whether capital punishment should be abolished.</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Education</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>遵从环保规定 <code>comply with environmental regulations</code> 遵守社会规范 <code>conform to social norms</code> 从入学第一天起学生就要遵守校规 <code>On the first day a pupil enters school, he is asked to conform to the school rules.</code>
</li>
<li>没有公司能与中国为敌 <code>No company can afford to antagonize China.</code> 合作融洽 <code>cooperate in harmony</code> 寄宿学校学生学会合作和互让,为以后成功培养人际交往能力 <code>In a boarding school, students learn to cooperate and compromise, and develop interpersonal skills needed for future successes.</code> #
</li>
<li>取长补短 <code>learn from other's strong points and overcome our weakness</code> 求同存异 <code>to seek common ground while reserving differences</code> 盲目/机械地照做 <code>copy things blindly/mechanically</code> # 扼杀天才 <code>kill one's talent</code> 其实正相反,压力扼杀创造力 <code>Quite the opposite/On the contrary, I think pressure stifles creativity.</code>
</li>
<li>消除误解 <code>correct misapprehension</code> 改正过错 <code>correct one's fault</code> 改变印象 <code>correct impression</code>
</li>
<li>养育孩子 <code>bring up children</code> 提出一个课题 <code>bring up a subject</code> 培养责任感 <code>cultivate a strong sense of responsibility</code> 出国留学开阔视野充实思想培养自立 <code>Overseas study broadens one's vision, enriches one's mind and cultivates independence.</code>
</li>
<li>违抗母亲 <code>defy my mother</code> 我敢说你不知道答案 <code>I defy you to come up with an answer</code> 挑战权威 <code>challenge the authority</code> 学生认为老师说的不对提出质疑 <code>Once students think what a teacher says is not correct, they defy him.</code>
</li>
<li>远程教育和传统教育互补 <code>Tele-education and traditional classroom teaching complement each other.</code>
</li>
<li>学生应该专心学习,兼职可能会分散注意力 <code>A student should concentrate his/her attention on academic study and taking a part time job may divert his/her attention.</code>
</li>
<li>他拒绝透露关于那个人的任何消息 <code>He refused to divulge any information related to/regarding/concerning/involving the man's whereabouts.</code> 大学生应该更关心公共事务 <code>College students should concern themselves more with public affairs.</code>
</li>

<li>优缺点 <code>merits and demerits</code> 艺术成就 <code>artistic achievement</code> 科学成就 <code>scientific achievement</code> 穿校服提高成绩应该普及 <code>School uniforms increase attendance and academic achievements, so the practice of wearing uniforms at school should be popularised.</code> #
</li>

<li>令人讨厌的是 <code>to one's annoyance</code> 担心别人的问题 <code>fret about everyone else's problems</code> 在我背后说闲话让人恼火 <code>It vexed me to think of others gossiping behind my back.</code> 父母烦恼与孩子游戏成瘾 <code>Parents are annoyed with children's addiction to computer games.</code>
</li>
<li>无法避免 <code>unavoidable</code> 必然地 <code>inevitably</code> # 逃避税/问题/目光 <code>evade paying tax/issue/one's eyes</code> 特意回避 <code>we all shunned him</code> # 避免尴尬/误会 <code>avoid embarrassment/misleading</code> 年轻人学会花钱避免浪费 <code>Young people should learn to spend money carefully and avoid extravagance.</code> #
</li>
<li>不可否认学校该禁烟 <code>It's undeniable that smoking should be banned in school.</code>
</li>
<li>学术不端 <code>academic misconduct</code> 做实验 <code>conduct an experiment</code> 违法行为 <code>wrongdoing</code> 他表现勇敢 <code>He behaved with great courage.</code>
</li>
<li>年轻人沉静其中而没有意识到他们有多努力 <code>The youngsters were so absorbed in it and did not realise how much they are exerting themselves.</code> 不要做无用功 <code>Do not exert yourself unnecessarily.</code>
</li>

<li>信守诺言 <code>abide by one's commitment</code> 遵守规则 <code>abide by the rules</code> 教育儿童遵守法律 <code>Children should be taught to abide by the law.</code>
</li>

<li>分配一大笔资金 <code>allocate a large sum of money</code> 任务(给)、资源 <code>allocate a task to someone/resources</code> 分配给公共教育的资金不该被滥用 <code>Funds allocated for public education should not be misused.</code>
</li>
<li>为无家可归者提供食宿 <code>afford food and beds for the homeless</code> 无法支付巨额损失 <code>cannot afford to pay for the loss</code> 农村儿童没钱上学成文盲 <code>In rural areas, many children can't afford to go to school and become illiterates.</code>
</li>
<li>情感 <code>affection</code> 受感染的 <code>infected</code> 影响学习成绩 <code>affect school achievement</code> 家庭关系 <code>family relationship</code> 心理健康发展 <code>healthy psychological development</code> 沉溺电脑游戏严重影响学习 <code>Indulgence in computer game will affect one's academic performance seriously.</code>
</li>
<li>主张或反对(观点) <code>argue for or argue against</code> 倡导世界和平 <code>advocate world peace</code> 为了吸引人们从事教育,专家主张提高工资 <code>In order to attract more people to take up teaching as their lifelong pursuit, some experts advocate higher salaries for teachers.</code> #
</li>
<li>公认地 <code>admittedly</code> 承认失败 <code>admit defeat</code> / 承认罪行 <code>admit one's crime</code> 考生没通过考试不会被录取 <code>If a candidate fails in the IELTS test, he/she will not be admitted into a university in Australia.</code> #
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Animal</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>熊猫和秃鹰被列为濒危物种 <code>Pandas and bald eagles are classified as endangered species.</code> #
</li>
<li>sue complain grumble whine mutter murmur 邻居家养宠物的人们总是埋怨睡觉被吵醒 <code>People whose neighbours have pets always complain that their sleep is interrupted at midnight by the pets' noises.</code>
</li>

<li>年轻人适应新环境的能力 <code>the adaptability of youth to new surroundings</code> 社会适应力 <code>the adaptability to the society</code> 砍伐森林导致动物灭亡 <code>The deforestation will drive animals without the adaptability to new surroundings into mass extinction.</code>
</li>
<li>请某人援助 <code>call in one's aid</code> 急救 <code>first aid</code> 经济援助 <code>financial aid</code> 国际援助 <code>international aid</code> 与宠物的积极关系有助于建立与他人的信任 <code>Positive relationships with pets can be an aid in the development of trusting relationships with others.</code>
</li>
<li>禁毒运动 <code>a campaign against drug abuse</code> 竞选活动 <code>an election campaign</code> 参加游行 <code>join the parade</code> 发起运动 <code>launch a campaign</code> 中国越来越多人加入到保护珍稀动物的运动 <code>More and more people in China have entered the campaign to save rare animals from extinction.</code>
</li>

<li>据说 <code>assertedly</code> 证实观点 <code>affirm the opinion</code> 宣读诗篇 <code>declaim verse to us</code> 宣布你们结为夫妻 <code>I now pronounce you husband and wife.</code> # 这个缺点抵消了本来还算开明的态度 <code>the weakness negate his otherwise progressive attitude</code> 维护权利 <code>assert one's rights</code> 动物保护人士反对为了人类利益虐待动物 <code>Animal activists assert their opposition to the fact that animals are abused for man's interests.</code>
</li>

<li>滥用权力 <code>abuse one's rights</code> 虐待动物不道德 <code>It's unethical and barbaric to abuse animals.</code>
</li>
</ul>
</div>
</div>
