topics.org
* Work & Life :MY2
- 业余爱好 =leisure time pursuits influence your thought-habit=

- 这篇文章除了长之外没什么不好 =The article is long, but not otherwise blameworthy.= 警告或批评 =to admonish or censure= # 有争议的政策引来国际批评 =The controversial policy have attracted international censure.= 谴责侵略,请求宽容 =denounce the invasion and plead for tolerance= # 把火灾归咎为短路 =They blamed an electric short circuit for the fire yesterday.=
- 合理的处理方法是清除堵塞物 =The logical treatment is to remove the blockage.= 人们被困在被封锁的小镇 =People are trapped in the town, which has been blockaded.= 调查受阻 =the investigation was hindered by= 汽车自行车停路边严重阻碍交通 =Cars and bikes parked along the streets block the flow of traffic, sometimes leading to serious traffic congestion.= #
- 打扰了请问地铁站怎么走 =Sorry to bother you, but can you direct me to the nearest metro station?=
- 开阔视野 =broaden one's horizon= 扩大知识面 =broaden one's scope of knowledge= 开阔眼界 =broaden one's vision= 旅行开阔心智 =Traveling broadens the mind.= #
- 传达看法 =convey one's view to= 开放办公环境使员工自由交流 =An open office environment makes workers communicate directly and freely.=
- 发展中国家与发达国家竞争世界市场 =Developing countries have to compete with developed countries for the world market.=

- 移民融入社区 =immigrants try to assimilate into the community= 埋头苦干 =absorption in one's work= 潜心研究 =absorption in study= 兼并部落 =absorption of smaller tribes= 食荤者为了营养吃肉 =As for proponents of meat eating, absorption of nourishment is the major reason for them to have meat.= #
- 经济持续下滑 =the economy is continuing to backslide= 不接触同事不了解公司状况阻碍职业发展 =The lack of daily contact with coworkers could take us out of the loop relative to what is going on within the company. This lack of inside knowledge could affect our advancement within the company.=
- 生态系统崩溃 =breakdown of the ecosystem= 身体垮掉 =breakdown in heath= 人际关系紧张,工作压力大,竞争激烈导致白领精神崩溃 =Tense human relationships, heavy pressure from work and life and fierce competition contribute to many white-collar workers' nervous breakdown.= #

- 改造房屋 =make alterations to the house= 改变态度/主意 =alter one's attitude/mind= 股票价格剧烈变动 =The stock price altered sharply.=
- 等候某人 =await someone= 期待某人到来 =anticipate one's arrival= 预支工资 =anticipate one's income= 期待广州之行愉快 =We anticipate great pleasure from our visit to Guangzhou.=
- 适用范围 =applicable scope= 这个职位有很多申请者 =lots of applicants for this position= 在读硕士 =a candidate for a Master's degree= 申请工作 =apply for a job= 申请会员 =apply for membership= 理论联系实际 =apply theory to practice= 勤劳简朴适应于一切事业 =The principle of diligence and frugality applies to all undertakings.=
- 鄙视某人 =despise someone= # 欣赏艺术 =appreciate the art= 欣赏不同文化 =appreciate a difference culture= 感激某人慷慨大方 =appreciate one's generosity= 感谢你发的培训小册子 =I shall appreciate it if you could send me some relevant booklets regarding the training programme.=
- 有父母在国外的儿童在18岁时没有资格接受免费高等教育 =Children who attain the age of 18 whilst a parent is abroad will not be eligible for free higher education.= 过去几年在跨国公司积累丰富经验 =In the past few year, I've been working for a famous multinational and therefor attained fair knowledge and rich experience in this field.=
- 服务员 =attendant= 出席者 =attendee= 上学 =attend school= 致力于事业 =attend to one's business= 政府需要关注老年人需求多建养老院 =The government should attend to the needs of the elderly and more nursing homes should be established.=
- 补偿...的损失 =compensate someone for the loss= 不偏不倚的观点 =a balanced point of view= 最佳生育年龄 =prime child-bearing age= 职业女性很难平衡工作和家庭 =Many career women find it really hard to balance work and family life.=

- 给留学生提供公寓 =accommodate overseas students with apartments= # 适应新环境 =accommodate to new circumstances= 容纳十人 =accommodate up to ten people= 街道难容私家车 =The narrow streets can hardly accommodate the increasingly large number of private cars.=
- 不适合这份工作 =unfit for the job= 适应社会环境 =adapt to social surroundings= 规范 =adapt to norms= 能够适应世界变化对个人很重要 =Learning to adapt to the changing world is of great significance to a person.= #

* Crime
- 控制平民获得武器途径 =control the flow of guns to general populace=
- 建设性地讨论 =constructive confrontation= 面临 =be confronted with= 把会议提前 =set forward the meeting= 面对棘手问题提出以下有效措施 =Confronted with such a thorny issue, people set forth the following effective measures.=
- 断定 =allege something without proof= 嘴上说说却从不付诸行动 =purport to do something but never act out= 青少年犯罪值得关注 =Juvenile delinquency is one of the several matters that claims the public attention.=
- 犯下滔天罪行 =commit a heinous crime= 凶杀 =commit murder= 竞争激烈白领自杀数上升 =The number of white-collar workers who commit suicide increases with the increasingly intensive social competition.=
- 被迫认罪 =be coerced into pleading guilty= 对零售商强制罚款 =fines are imposed on retailers= 一部充满恐怖暴力但却引人入胜的电影 =a frighteningly violent yet compelling film= 酸雨迫使人们呆在屋里 =Acid rain compels people to stay indoors.=
- 为暴行赎罪 =atone for atrocities it committed= 光阴一去不复返 =Nothing can compensate for the loss of time.=

- 满口脏话 =abusive= 青少年犯罪 =juvenile delinquency= 对儿童施虐 =subject a child to abuse= 滥用药物 =substance abuse= 滥用特权 =the abuse of privilege= 运动员服用禁药并不少见 =Abuse of performance-enhancing drugs is not uncommon among athletes.= #
- 对形势的冷静估计 =a calm appraisal of the situation= 工作评价 =assessment of work performance= 损失评估 =damage/loss assessment= 不充分讨论利弊无法评估毒品合法化必要性 =It's hard to make assessment on the necessity of drug legalisation if merits and demerits are not fully discussed.=

- 怀疑论者将其归因于生活的不公 =A sceptic may put it down to life inequalities.= 成功的婚姻归因于魅力,奉献和耐心 =A successful marriage can be ascribed to attraction, devotion and patience.= 由于 =owing to= 青少年吸毒归咎于无知和好奇 =We often attribute youth drug abuse to ignorance and curiosity.=

