topics.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Rights</h2>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Work &amp; Life</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>业余爱好 <code>leisure time pursuits influence your thought-habit</code>
</li>

<li>这篇文章除了长之外没什么不好 <code>The article is long, but not otherwise blameworthy.</code> 警告或批评 <code>to admonish or censure</code> # 有争议的政策引来国际批评 <code>The controversial policy have attracted international censure.</code> 谴责侵略,请求宽容 <code>denounce the invasion and plead for tolerance</code> # 把火灾归咎为短路 <code>They blamed an electric short circuit for the fire yesterday.</code>
</li>
<li>合理的处理方法是清除堵塞物 <code>The logical treatment is to remove the blockage.</code> 人们被困在被封锁的小镇 <code>People are trapped in the town, which has been blockaded.</code> 调查受阻 <code>the investigation was hindered by</code> 汽车自行车停路边严重阻碍交通 <code>Cars and bikes parked along the streets block the flow of traffic, sometimes leading to serious traffic congestion.</code> #
</li>
<li>打扰了请问地铁站怎么走 <code>Sorry to bother you, but can you direct me to the nearest metro station?</code>
</li>
<li>开阔视野 <code>broaden one's horizon</code> 扩大知识面 <code>broaden one's scope of knowledge</code> 开阔眼界 <code>broaden one's vision</code> 旅行开阔心智 <code>Traveling broadens the mind.</code> #
</li>
<li>传达看法 <code>convey one's view to</code> 开放办公环境使员工自由交流 <code>An open office environment makes workers communicate directly and freely.</code>
</li>
<li>发展中国家与发达国家竞争世界市场 <code>Developing countries have to compete with developed countries for the world market.</code>
</li>

<li>移民融入社区 <code>immigrants try to assimilate into the community</code> 埋头苦干 <code>absorption in one's work</code> 潜心研究 <code>absorption in study</code> 兼并部落 <code>absorption of smaller tribes</code> 食荤者为了营养吃肉 <code>As for proponents of meat eating, absorption of nourishment is the major reason for them to have meat.</code> #
</li>
<li>经济持续下滑 <code>the economy is continuing to backslide</code> 不接触同事不了解公司状况阻碍职业发展 <code>The lack of daily contact with coworkers could take us out of the loop relative to what is going on within the company. This lack of inside knowledge could affect our advancement within the company.</code>
</li>
<li>生态系统崩溃 <code>breakdown of the ecosystem</code> 身体垮掉 <code>breakdown in heath</code> 人际关系紧张,工作压力大,竞争激烈导致白领精神崩溃 <code>Tense human relationships, heavy pressure from work and life and fierce competition contribute to many white-collar workers' nervous breakdown.</code> #
</li>

<li>改造房屋 <code>make alterations to the house</code> 改变态度/主意 <code>alter one's attitude/mind</code> 股票价格剧烈变动 <code>The stock price altered sharply.</code>
</li>
<li>等候某人 <code>await someone</code> 期待某人到来 <code>anticipate one's arrival</code> 预支工资 <code>anticipate one's income</code> 期待广州之行愉快 <code>We anticipate great pleasure from our visit to Guangzhou.</code>
</li>
<li>适用范围 <code>applicable scope</code> 这个职位有很多申请者 <code>lots of applicants for this position</code> 在读硕士 <code>a candidate for a Master's degree</code> 申请工作 <code>apply for a job</code> 申请会员 <code>apply for membership</code> 理论联系实际 <code>apply theory to practice</code> 勤劳简朴适应于一切事业 <code>The principle of diligence and frugality applies to all undertakings.</code>
</li>
<li>鄙视某人 <code>despise someone</code> # 欣赏艺术 <code>appreciate the art</code> 欣赏不同文化 <code>appreciate a difference culture</code> 感激某人慷慨大方 <code>appreciate one's generosity</code> 感谢你发的培训小册子 <code>I shall appreciate it if you could send me some relevant booklets regarding the training programme.</code>
</li>
<li>有父母在国外的儿童在18岁时没有资格接受免费高等教育 <code>Children who attain the age of 18 whilst a parent is abroad will not be eligible for free higher education.</code> 过去几年在跨国公司积累丰富经验 <code>In the past few year, I've been working for a famous multinational and therefor attained fair knowledge and rich experience in this field.</code>
</li>
<li>服务员 <code>attendant</code> 出席者 <code>attendee</code> 上学 <code>attend school</code> 致力于事业 <code>attend to one's business</code> 政府需要关注老年人需求多建养老院 <code>The government should attend to the needs of the elderly and more nursing homes should be established.</code>
</li>
<li>补偿&#x2026;的损失 <code>compensate someone for the loss</code> 不偏不倚的观点 <code>a balanced point of view</code> 最佳生育年龄 <code>prime child-bearing age</code> 职业女性很难平衡工作和家庭 <code>Many career women find it really hard to balance work and family life.</code>
</li>

<li>给留学生提供公寓 <code>accommodate overseas students with apartments</code> # 适应新环境 <code>accommodate to new circumstances</code> 容纳十人 <code>accommodate up to ten people</code> 街道难容私家车 <code>The narrow streets can hardly accommodate the increasingly large number of private cars.</code>
</li>
<li>不适合这份工作 <code>unfit for the job</code> 适应社会环境 <code>adapt to social surroundings</code> 规范 <code>adapt to norms</code> 能够适应世界变化对个人很重要 <code>Learning to adapt to the changing world is of great significance to a person.</code> #
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Crime</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>控制平民获得武器途径 <code>control the flow of guns to general populace</code>
</li>
<li>建设性地讨论 <code>constructive confrontation</code> 面临 <code>be confronted with</code> 把会议提前 <code>set forward the meeting</code> 面对棘手问题提出以下有效措施 <code>Confronted with such a thorny issue, people set forth the following effective measures.</code>
</li>
<li>断定 <code>allege something without proof</code> 嘴上说说却从不付诸行动 <code>purport to do something but never act out</code> 青少年犯罪值得关注 <code>Juvenile delinquency is one of the several matters that claims the public attention.</code>
</li>
<li>犯下滔天罪行 <code>commit a heinous crime</code> 凶杀 <code>commit murder</code> 竞争激烈白领自杀数上升 <code>The number of white-collar workers who commit suicide increases with the increasingly intensive social competition.</code>
</li>
<li>被迫认罪 <code>be coerced into pleading guilty</code> 对零售商强制罚款 <code>fines are imposed on retailers</code> 一部充满恐怖暴力但却引人入胜的电影 <code>a frighteningly violent yet compelling film</code> 酸雨迫使人们呆在屋里 <code>Acid rain compels people to stay indoors.</code>
</li>
<li>为暴行赎罪 <code>atone for atrocities it committed</code> 光阴一去不复返 <code>Nothing can compensate for the loss of time.</code>
</li>

<li>满口脏话 <code>abusive</code> 青少年犯罪 <code>juvenile delinquency</code> 对儿童施虐 <code>subject a child to abuse</code> 滥用药物 <code>substance abuse</code> 滥用特权 <code>the abuse of privilege</code> 运动员服用禁药并不少见 <code>Abuse of performance-enhancing drugs is not uncommon among athletes.</code> #
</li>
<li>对形势的冷静估计 <code>a calm appraisal of the situation</code> 工作评价 <code>assessment of work performance</code> 损失评估 <code>damage/loss assessment</code> 不充分讨论利弊无法评估毒品合法化必要性 <code>It's hard to make assessment on the necessity of drug legalisation if merits and demerits are not fully discussed.</code>
</li>

<li>怀疑论者将其归因于生活的不公 <code>A sceptic may put it down to life inequalities.</code> 成功的婚姻归因于魅力,奉献和耐心 <code>A successful marriage can be ascribed to attraction, devotion and patience.</code> 由于 <code>owing to</code> 青少年吸毒归咎于无知和好奇 <code>We often attribute youth drug abuse to ignorance and curiosity.</code>
</li>
</ul>
</div>
</div>
