topics.org
* Health
- 自相矛盾 =contradict oneself= 无数研究证明吸烟有害健康 =Numerous research and studies confirm the theory that smoking does harm to health.=
- 克服坏习惯 =conquer/break/overcome bad habit= # 现代医学攻克很多疾病 =Modern medical science has conquered many diseases.=
- 含有污染物 =contain contaminants= 自控 =contain oneself= 快餐吃多了有害身体 =Eating too much fast food is physically damaging, for fast foods contain to much sugar, fat and calories.=
- 过分沉溺于电脑游戏导致近视,肥胖和重复性损伤 =Overindulgence in computer games contributes to myopia, obesity and repetitive stress injuries.=
- 过早地处于亚健康状态 =be in the state of sub-health prematurely=
- 解决办法就在政府手中 =The remedy lies in the hands of the government.= 万灵药 =cure-all= 身患绝症 =suffering incurable/terminal disease= 克隆技术帮助治愈遗传疾病使人们过上健康生活 =The cloning technology would help scientists to cure genetic diseases and also other diseases so that people can live longer healthy lives.=

- 经济失调 =economic ailment= 微恙 =trifling ailment= 以肉奶为主的饮食习惯会引发各种慢性病和生理失调 =Meat and dairy centred diets are linked to many types of cancers, as well as chronic diseases such as heart ailments, diabetes, obesity, gallbladder diseases, hypertension, and more deadly diseases and psychological disorder.=
- 小儿麻痹首篇权威研究报告 =The first authoritative study report of polio was published in 1840.= 校方 =school authority= 经...许可 =by the authority of= 滥用职权 =strain one's authority= 卫生部门解决城市垃圾问题 =The health authority should take proper measures to deal with the increasingly serious rubbish problem in urban areas.=

- 爱慕地 =adoringly= 痛恨暴力 =abhor violence= 厌恶 =abominate/loathe/detest= 崇拜偶像 =adore idols= 充分意识到健康重要性,城市居民喜欢有氧运动 =Fully aware of the importance of health, many city dwellers adore aerobic exercise.=
- 采用积极生活方式 =adopt a more active lifestyle= 要长寿建议养成健康饮食和锻炼习惯 =To enjoy a longer lifespan, it is advisable for us adopt and maintain healthy patterns of diet and exercise.=
- 压力扰乱免疫系统 =pressure disorder our immune system= 脱离问题保持客观 =detach oneself from the problem and become more objective= 适应自然规律 =adjust to the nature= 白领调整生活方式保持健康 =White-collar workers should adjust their lifestyle in order to stay healthy.=

* Bonus
- is secondary to
- but otherwise
- not uncommon
- ineffective half-measures
- if it were not for
- in fact quite the oppsite

* Sleeping on the Job: Should You Nap at Work?
http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work
Sleeping on the job boosts productivity.
Siestas company policy.
Daytime drowsiness can affect mood, productivity, and creativity, but a brief nap may provide greater alertness for several hours to help improve attention, concentration and accuracy.
Napping perk.
Cardiovascular disease and depression.
Sleep-deprived workers.
Stretching out.
Dozing in your cubicle.
Fool passersby into thinking you’re hard at work.
Drool on your report.
Our inner body clocks start to make us feel drowsy around siesta time—or somewhere between 1 and 4 p.m.—so aim to fit in a nap during these hours.
Make quick naps a daily ritual.
Get into the sleep mindset.
Doze off.
Snooze.
Catnaps.
Avoid snoozing too long and waking up groggy.
Longer naps have the downside of greater sleep inertia.
Set your cell phone or another device to go off after about 15 minutes.
You’ll feel recharged enough to tackle your afternoon agenda and still hit the gym after work.

* TODO
sluggish/indolent
