topics.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Health</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>自相矛盾 <code>contradict oneself</code> 无数研究证明吸烟有害健康 <code>Numerous research and studies confirm the theory that smoking does harm to health.</code>
</li>
<li>克服坏习惯 <code>conquer/break/overcome bad habit</code> # 现代医学攻克很多疾病 <code>Modern medical science has conquered many diseases.</code>
</li>
<li>含有污染物 <code>contain contaminants</code> 自控 <code>contain oneself</code> 快餐吃多了有害身体 <code>Eating too much fast food is physically damaging, for fast foods contain to much sugar, fat and calories.</code>
</li>
<li>过分沉溺于电脑游戏导致近视,肥胖和重复性损伤 <code>Overindulgence in computer games contributes to myopia, obesity and repetitive stress injuries.</code>
</li>
<li>过早地处于亚健康状态 <code>be in the state of sub-health prematurely</code>
</li>
<li>解决办法就在政府手中 <code>The remedy lies in the hands of the government.</code> 万灵药 <code>cure-all</code> 身患绝症 <code>suffering incurable/terminal disease</code> 克隆技术帮助治愈遗传疾病使人们过上健康生活 <code>The cloning technology would help scientists to cure genetic diseases and also other diseases so that people can live longer healthy lives.</code>
</li>

<li>经济失调 <code>economic ailment</code> 微恙 <code>trifling ailment</code> 以肉奶为主的饮食习惯会引发各种慢性病和生理失调 <code>Meat and dairy centred diets are linked to many types of cancers, as well as chronic diseases such as heart ailments, diabetes, obesity, gallbladder diseases, hypertension, and more deadly diseases and psychological disorder.</code>
</li>
<li>小儿麻痹首篇权威研究报告 <code>The first authoritative study report of polio was published in 1840.</code> 校方 <code>school authority</code> 经&#x2026;许可 <code>by the authority of</code> 滥用职权 <code>strain one's authority</code> 卫生部门解决城市垃圾问题 <code>The health authority should take proper measures to deal with the increasingly serious rubbish problem in urban areas.</code>
</li>

<li>爱慕地 <code>adoringly</code> 痛恨暴力 <code>abhor violence</code> 厌恶 <code>abominate/loathe/detest</code> 崇拜偶像 <code>adore idols</code> 充分意识到健康重要性,城市居民喜欢有氧运动 <code>Fully aware of the importance of health, many city dwellers adore aerobic exercise.</code>
</li>
<li>采用积极生活方式 <code>adopt a more active lifestyle</code> 要长寿建议养成健康饮食和锻炼习惯 <code>To enjoy a longer lifespan, it is advisable for us adopt and maintain healthy patterns of diet and exercise.</code>
</li>
<li>压力扰乱免疫系统 <code>pressure disorder our immune system</code> 脱离问题保持客观 <code>detach oneself from the problem and become more objective</code> 适应自然规律 <code>adjust to the nature</code> 白领调整生活方式保持健康 <code>White-collar workers should adjust their lifestyle in order to stay healthy.</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Bonus</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>is secondary to
</li>
<li>but otherwise
</li>
<li>not uncommon
</li>
<li>ineffective half-measures
</li>
<li>if it were not for
</li>
<li>in fact quite the oppsite
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Sleeping on the Job: Should You Nap at Work?</h2>
<div class="outline-text-2" id="text-12">
<p>
<a href="http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work">http://www.mensfitness.com/nutrition/sleeping-on-the-job-should-you-nap-at-work</a>
Sleeping on the job boosts productivity.
Siestas company policy.
Daytime drowsiness can affect mood, productivity, and creativity, but a brief nap may provide greater alertness for several hours to help improve attention, concentration and accuracy.
Napping perk.
Cardiovascular disease and depression.
Sleep-deprived workers.
Stretching out.
Dozing in your cubicle.
Fool passersby into thinking you’re hard at work.
Drool on your report.
Our inner body clocks start to make us feel drowsy around siesta time—or somewhere between 1 and 4 p.m.—so aim to fit in a nap during these hours.
Make quick naps a daily ritual.
Get into the sleep mindset.
Doze off.
Snooze.
Catnaps.
Avoid snoozing too long and waking up groggy.
Longer naps have the downside of greater sleep inertia.
Set your cell phone or another device to go off after about 15 minutes.
You’ll feel recharged enough to tackle your afternoon agenda and still hit the gym after work.
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <span class="todo TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-13">
<p>
sluggish/indolent
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gu Feng</p>
<p class="date">Created: 2014-10-14 Tue 10:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.93.1 (<a href="http://orgmode.org">Org</a> mode 8.2.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
